[
    {
        "id": 1,
        "chefName": "Gennaro Contaldo",
        "chefPicture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ7tvgpMzQkb8RyNF95SlJNeRB9m0vID_L2iQ&usqp=CAU",
        "experience": "Over 50 years of experience in Italian cuisine",
        "recipes": [
            {
                "title": "Pasta e Fagioli",
                "ingredients": [
                    "1 pound dried cannellini beans",
                    "1/4 cup olive oil",
                    "1 onion, finely chopped",
                    "2 garlic cloves, minced",
                    "1 teaspoon dried thyme",
                    "1/2 teaspoon red pepper flakes",
                    "2 bay leaves",
                    "6 cups chicken or vegetable broth",
                    "1 pound ditalini pasta",
                    "1/2 cup grated Parmesan cheese",
                    "Salt and freshly ground black pepper"
                ],
                "cookingMethod":[
                    "Heat olive oil in a large pot over medium heat.",
                    "Add onions, garlic, and carrots. Cook, stirring occasionally, until softened, about 5-7 minutes.",
                    "Stir in tomato paste and cook for 1-2 minutes.",
                    "Add canned diced tomatoes, chicken or vegetable broth, and cooked beans. Stir to combine.",
                    "Bring the mixture to a boil, then reduce heat and let simmer for 20-30 minutes.",
                    "Add cooked pasta to the pot and stir to combine.",
                    "Season with salt, pepper, and any other desired herbs or spices.",
                    "Serve hot and enjoy!"
                  ]
            },
            {
                "title": "Pizza Margherita",
                "ingredients": [
                    "1 pound pizza dough",
                    "1/4 cup tomato sauce",
                    "8 ounces fresh mozzarella cheese, sliced",
                    "1/4 cup chopped fresh basil",
                    "2 tablespoons olive oil",
                    "Salt and freshly ground black pepper"
                ],
                "cookingMethod": [
                    "Preheat the oven to 500°F (260°C).",
                    "Roll out the pizza dough on a floured surface to the desired thickness.",
                    "Spread the tomato sauce evenly over the dough, leaving a small border around the edges.",
                    "Top with the mozzarella cheese and sprinkle with the chopped basil.",
                    "Drizzle the olive oil over the top and season with salt and pepper.",
                    "Bake for 12-15 minutes, until the crust is golden brown and the cheese is melted and bubbly.",
                    "Slice and serve hot."
                ]
            },
            {
                "title": "Risotto alla Milanese",
                "ingredients": [
                    "6 cups chicken or vegetable broth",
                    "3 tablespoons butter",
                    "1 onion, finely chopped",
                    "1 1/2 cups Arborio rice",
                    "1/2 cup dry white wine",
                    "1/2 cup grated Parmesan cheese",
                    "Salt and freshly ground black pepper",
                    "A pinch of saffron threads"
                ],
                "cookingMethod": [
                    "Heat the broth in a saucepan and keep it simmering.",
                    "In a separate large pot, melt the butter over medium heat. Add the onion and cook until softened, about 5 minutes.",
                    "Add the rice and stir to coat with the butter. Cook for 2-3 minutes, until the rice is lightly toasted.",
                    "Add the wine and stir until it has been absorbed by the rice.",
                    "Add a ladleful of hot broth to the pot and stir until it has been absorbed by the rice. Continue adding broth, one ladleful at a time, stirring constantly and waiting for each addition to be absorbed before adding the next.",
                    "After about 15-20 minutes, when the rice is tender but still al dente, stir in the Parmesan cheese and saffron threads. Season with salt and pepper to taste.",
                    "Remove from the heat and let the risotto rest for a minute or two before serving."
                ]
            }
        ],
        "bio": "Gennaro Contaldo is a well-known Italian chef who has been cooking for over 50 years. He has worked in some of the best Italian restaurants in the UK and has appeared on numerous cooking shows. Gennaro is known for his simple, authentic Italian dishes and his passion for fresh, seasonal ingredients.",
        "likes": 1000,
        "rating": 4.2
    },
    {
        "id": 2,
        "chefName": "Lidia Bastianich",
        "chefPicture": "https://s.abcnews.com/images/GMA/230301_gma_digital_1_lidiabastianich_hpMain_4x5_608.jpg",
        "experience": "Over 40 years of experience in Italian cuisine",
        "recipes": [
            {
                "title": "Pasta Carbonara",
                "ingredients": [
                    "1 pound spaghetti",
                    "1/2 pound pancetta or bacon, diced",
                    "4 large egg yolks",
                    "1 cup grated Pecorino Romano cheese",
                    "1/2 cup grated Parmesan cheese",
                    "2 cloves garlic, minced",
                    "Salt and freshly ground black pepper"
                ],
                "cookingMethod": [
                    "Bring a large pot of salted water to a boil. Add the spaghetti and cook until al dente.",
                    "While the pasta is cooking, heat a large skillet over medium heat. Add the pancetta and cook until crisp.",
                    "In a bowl, whisk together the egg yolks, Pecorino Romano cheese, Parmesan cheese, and garlic.",
                    "When the pasta is done, reserve 1 cup of the pasta water and drain the rest.",
                    "Add the pasta to the skillet with the pancetta and toss to coat with the fat. Remove from the heat.",
                    "Slowly pour the egg mixture over the pasta, stirring constantly to coat the noodles. Add some of the reserved pasta water if the sauce is too thick.",
                    "Season with salt and pepper to taste.",
                    "Serve hot, garnished with additional grated cheese and freshly ground black pepper."
                ]
            },
            {
                "title": "Osso Buco",
                "ingredients": [
                    "4 veal shanks, about 1 pound each",
                    "Salt and freshly ground black pepper",
                    "1/2 cup all-purpose flour",
                    "3 tablespoons olive oil",
                    "1 onion, finely chopped",
                    "2 celery stalks, finely chopped",
                    "2 carrots, finely chopped",
                    "4 cloves garlic, minced",
                    "2 cups chicken or beef broth",
                    "1 cup dry white wine",
                    "1 can (28 ounces) crushed tomatoes",
                    "1/4 cup chopped fresh parsley",
                    "1 tablespoon grated lemon zest",
                    "1 tablespoon chopped fresh thyme",
                    "1 bay leaf"
                ],
                "cookingMethod": [
                    "Preheat the oven to 375°F (190°C).",
                    "Season the veal shanks with salt and pepper and dredge them in the flour.",
                    "In a large oven-safe pot or Dutch oven, heat the olive oil over medium-high heat. Add the veal shanks and cook until browned on all sides.",
                    "Remove the veal shanks from the pot and set aside.",
                    "Add the onion, celery, carrots, and garlic to the pot and cook until the vegetables are soft and lightly browned, about 5-7 minutes.",
                    "Add the broth, wine, crushed tomatoes, parsley, lemon zest, thyme, and bay leaf to the pot. Stir to combine.",
                    "Return the veal shanks to the pot and spoon some of the tomato mixture over each one.",
                    "Cover the pot with a tight-fitting lid and transfer to the oven. Cook for 2-3 hours, or until the meat is very tender and falling off the bone.",
                    "Serve hot, garnished with additional chopped parsley if desired."
                ]
            },
            {
                "title": "Spaghetti Carbonara",
                "ingredients": [
                    "1 pound spaghetti",
                    "6 ounces pancetta, diced",
                    "4 large egg yolks",
                    "1 cup freshly grated Parmesan cheese",
                    "1/2 cup freshly grated Pecorino Romano cheese",
                    "1/4 teaspoon freshly ground black pepper",
                    "Salt to taste"
                ],
                "cookingMethod": [
                    "Bring a large pot of salted water to a boil. Add the spaghetti and cook until al dente.",
                    "While the pasta is cooking, cook the pancetta in a large skillet over medium heat until crispy.",
                    "In a large bowl, whisk together the egg yolks, Parmesan cheese, Pecorino Romano cheese, black pepper, and a pinch of salt.",
                    "When the pasta is done, reserve 1 cup of the pasta water and drain the rest.",
                    "Add the pasta to the skillet with the pancetta and toss to combine.",
                    "Remove the skillet from the heat and let it cool for a minute or two.",
                    "Add the egg mixture to the skillet and toss the pasta until the eggs are cooked and the sauce is creamy, adding some of the reserved pasta water if needed to thin the sauce.",
                    "Serve hot, garnished with additional grated cheese and black pepper if desired."
                ]
            }
        ],
        "bio": "Lidia Bastianich is an Italian-American chef, television host, author, and restaurateur. She is the owner of several Italian restaurants in the US and has written several cookbooks. Lidia is known for her traditional Italian dishes and her emphasis on fresh, seasonal ingredients.",
        "likes": 2000,
        "rating": 4.0
    },
    {
        "id": 3,
        "chefName": "Massimo Bottura",
        "chefPicture": "https://officialbespoke.co/wp-content/uploads/2016/08/2015_11_08-HIE-Photo-Massimo-Press-59.jpg",
        "experience": "Award-winning chef and owner of Osteria Francescana in Modena, Italy",
        "recipes": [
            {
                "title": "Tortellini in Brodo",
                "ingredients": [
                    "For the broth:",
                    "2 pounds beef or chicken bones",
                    "2 carrots, roughly chopped",
                    "2 celery stalks, roughly chopped",
                    "1 onion, roughly chopped",
                    "1 bay leaf",
                    "For the tortellini filling:",
                    "1/2 pound ground pork",
                    "1/2 pound ground beef",
                    "1/2 cup grated Parmesan cheese",
                    "1/2 cup grated Pecorino Romano cheese",
                    "1/2 cup fresh breadcrumbs",
                    "1 egg, lightly beaten",
                    "1/4 teaspoon freshly grated nutmeg",
                    "Salt and freshly ground black pepper",
                    "For the pasta dough:",
                    "2 cups all-purpose flour",
                    "2 large eggs",
                    "1/2 teaspoon salt",
                    "1/4 cup water",
                    "For serving:",
                    "Chopped fresh parsley",
                    "Grated Parmesan cheese"
                ],
                "cookingMethod": [
                    "Make the broth: In a large pot, combine the bones, carrots, celery, onion, bay leaf, and enough water to cover. Bring to a boil, then reduce the heat and simmer for 4-6 hours, skimming any foam that rises to the surface.",
                    "Strain the broth through a fine-mesh sieve and discard the solids. Return the broth to the pot and keep warm over low heat.",
                    "Make the tortellini filling: In a bowl, combine the ground pork, ground beef, Parmesan cheese, Pecorino Romano cheese, breadcrumbs, egg, nutmeg, and some salt and pepper. Mix well.",
                    "Make the pasta dough: In a food processor, pulse the flour and eggs until the mixture resembles coarse sand. Add the salt and water and pulse until the dough comes together in a ball.",
                    "Knead the dough on a lightly floured surface until smooth and elastic, about 10 minutes. Cover with a damp towel and let rest for 30 minutes.",
                    "Roll out the pasta dough on a lightly floured surface to a thickness of about 1/8 inch. Cut the dough into small circles using a cookie cutter or a glass.",
                    "Place a small spoonful of the tortellini filling in the center of each pasta circle. Fold the circle in half to form a half-moon shape and pinch the edges together to seal. Bring the two corners of the half-moon together and pinch to form the tortellini shape.",
                    "Bring a large pot of salted water to a boil. Add the tortellini and cook for 2-3 minutes, or until they float to the surface.",
                    "To serve, divide the tortellini among serving bowls and ladle the warm broth over them. Garnish with chopped parsley and grated Parmesan cheese."
                ]
            },
            {
                "title": "Risotto alla Milanese",
                "ingredients": [
                    "1 small onion, finely chopped",
                    "2 tablespoons unsalted butter",
                    "1 cup Arborio rice",
                    "1/2 cup dry white wine",
                    "4 cups chicken or vegetable broth",
                    "1/2 teaspoon saffron threads",
                    "1/2 cup grated Parmesan cheese",
                    "Salt and freshly ground black pepper"
                ],
                "cookingMethod": [
                    "In a large saucepan, melt the butter over medium heat. Add the onion and sauté until translucent, about 5 minutes.",
                    "Add the rice and stir to coat with the butter. Cook for 1-2 minutes, stirring constantly, until the rice is lightly toasted.",
                    "Add the wine and stir until it has been absorbed by the rice.",
                    "Add a ladleful of the broth to the rice and stir constantly until the liquid has been absorbed. Continue adding the broth, one ladleful at a time, stirring constantly and allowing each addition to be absorbed before adding the next.",
                    "After about 15-20 minutes, when the rice is al dente and creamy, add the saffron threads and stir to combine.",
                    "Remove the risotto from the heat and stir in the Parmesan cheese. Season with salt and pepper to taste.",
                    "Serve the risotto hot, garnished with additional Parmesan cheese if desired."
                ]
            },
            {
                "title": "Pappardelle with Wild Boar Ragu",
                "ingredients": [
                    "For the ragu:",
                    "1 pound wild boar meat, trimmed and diced",
                    "1 onion, finely chopped",
                    "1 carrot, finely chopped",
                    "1 celery stalk, finely chopped",
                    "2 garlic cloves, minced",
                    "2 tablespoons tomato paste",
                    "1 cup dry red wine",
                    "1 cup chicken or beef broth",
                    "1 tablespoon chopped fresh rosemary",
                    "1 tablespoon chopped fresh thyme",
                    "Salt and freshly ground black pepper",
                    "For the pasta:",
                    "1 pound fresh pappardelle",
                    "1/4 cup grated Parmesan cheese"
                ],
                "cookingMethod": [
                    "Make the ragu: In a large skillet or Dutch oven, heat some olive oil over medium-high heat. Add the wild boar meat and cook until browned on all sides, about 5 minutes. Remove the meat and set aside.",
                    "Add the onion, carrot, celery, and garlic to the skillet and sauté until softened, about 5 minutes.",
                    "Add the tomato paste and stir to coat the vegetables. Add the wine and broth and bring to a simmer.",
                    "Add the wild boar meat back to the skillet and stir to combine. Add the rosemary, thyme, and some salt and pepper. Cover and simmer over low heat for 2-3 hours, stirring occasionally, until the meat is tender and the sauce is thick and rich.",
                    "Make the pasta according to the package directions. Drain the pasta and transfer it to a large serving bowl.",
                    "Top the pasta with the wild boar ragu and sprinkle with Parmesan cheese. Serve hot."
                ]
            }
        ],
        "bio": "Massimo Bottura is one of the world's most celebrated chefs, known for his innovative approach to traditional Italian cuisine. His restaurant, Osteria Francescana, has been awarded three Michelin stars and was named the best restaurant in the world in 2016 and 2018 by The World's 50 Best Restaurants.",
        "likes": 5000,
        "rating": 4.4
    },
    {
        "id": 4,
        "chefName": "Giada De Laurentiis",
        "chefPicture": "https://imageio.forbes.com/blogs-images/debbikickham/files/2019/04/Forbes-Giada-headshot.jpg?format=jpg&width=1200",
        "experience": "20+ years",
        "recipes": [
            {
                "title": "Linguine with Clams",
                "ingredients": [
                    "1 pound linguine",
                    "1/2 cup extra-virgin olive oil",
                    "8 garlic cloves, thinly sliced",
                    "2 small red chilies, seeded and minced",
                    "2 pounds small clams, such as littlenecks or Manila, scrubbed",
                    "1 cup dry white wine",
                    "1/4 cup chopped fresh parsley",
                    "Salt and freshly ground black pepper"
                ],
                "cookingMethod": [
                    "Bring a large pot of salted water to a boil. Add the linguine and cook until al dente.",
                    "Meanwhile, in a large skillet, heat the olive oil over medium heat. Add the garlic and chilies and sauté until fragrant, about 1 minute.",
                    "Add the clams and wine, cover the skillet, and cook until the clams have opened, about 5-7 minutes. Discard any clams that have not opened.",
                    "Drain the linguine and add it to the skillet with the clams. Toss to combine, adding more olive oil or pasta water as needed to create a sauce.",
                    "Add the parsley and season with salt and pepper to taste.",
                    "Serve the linguine hot, garnished with additional parsley if desired."
                ]
            },
            {
                "title": "Eggplant Parmesan",
                "ingredients": [
                    "2 large eggplants, sliced into 1/4-inch rounds",
                    "Salt",
                    "2 cups all-purpose flour",
                    "4 large eggs",
                    "4 cups panko breadcrumbs",
                    "1/2 cup grated Parmesan cheese",
                    "1/4 cup chopped fresh basil",
                    "2 cups marinara sauce",
                    "2 cups shredded mozzarella cheese"
                ],
                "cookingMethod": [
                    "Preheat the oven to 375°F. Line a baking sheet with parchment paper.",
                    "Place the eggplant slices on the baking sheet and sprinkle with salt. Let sit for 30 minutes to release any excess water.",
                    "Meanwhile, prepare the breading station. Place the flour in a shallow bowl. In another shallow bowl, beat the eggs. In a third shallow bowl, mix together the panko breadcrumbs, Parmesan cheese, and basil.",
                    "Pat the eggplant slices dry with paper towels. Dredge each slice in the flour, shaking off any excess. Dip each slice in the beaten eggs, then coat in the breadcrumb mixture.",
                    "Place the breaded eggplant slices on the prepared baking sheet and bake for 20-25 minutes, or until golden brown and crispy.",
                    "Spread some marinara sauce in the bottom of a 9x13-inch baking dish. Place a layer of eggplant slices over the sauce. Top with more sauce and some shredded mozzarella cheese. Repeat the layers until all the eggplant slices are used up.",
                    "Bake the eggplant Parmesan for 30-35 minutes, or until bubbly and golden brown on top.",
                    "Let the eggplant Parmesan cool for a few minutes before slicing and serving."
                ]
            },
            {
                "title": "Tiramisu",
                "ingredients": [
                    "6 large egg yolks",
                    "3/4 cup granulatedsugar",
                    "2/3 cup whole milk",
                    "1/4 cup Marsala or brandy",
                    "1 1/2 cups heavy cream",
                    "1 cup mascarpone cheese",
                    "2 cups brewed espresso or strong coffee, cooled",
                    "1/2 cup Kahlua or other coffee liqueur",
                    "1 package ladyfingers (about 24 cookies)",
                    "Cocoa powder, for dusting"
                ],
                "cookingMethod": [
                    "In a medium saucepan, whisk together the egg yolks and sugar until well combined. Whisk in the milk and Marsala or brandy.",
                    "Cook the mixture over low heat, stirring constantly, until it thickens and coats the back of a spoon, about 10 minutes.",
                    "Remove the saucepan from the heat and let the mixture cool completely.",
                    "In a large bowl, beat the heavy cream until stiff peaks form.",
                    "In another large bowl, beat the mascarpone cheese until smooth. Fold in the cooled egg yolk mixture.",
                    "Fold the whipped cream into the mascarpone mixture until well combined.",
                    "In a shallow dish, whisk together the brewed espresso and coffee liqueur.",
                    "Dip the ladyfingers into the espresso mixture, one at a time, and arrange them in a single layer in the bottom of a 9x13-inch baking dish.",
                    "Spread half of the mascarpone mixture over the ladyfingers. Repeat with another layer of soaked ladyfingers and the remaining mascarpone mixture.",
                    "Cover the baking dish with plastic wrap and refrigerate the tiramisu for at least 2 hours, or overnight.",
                    "When ready to serve, dust the top of the tiramisu with cocoa powder. Cut into squares and serve chilled."
                ]
            },
            {
                "name": "Spaghetti Carbonara",
                "ingredients": [
                    "1 pound spaghetti",
                    "1/2 pound pancetta or bacon, diced",
                    "4 garlic cloves, minced",
                    "4 large eggs",
                    "1 cup freshly grated Parmesan cheese",
                    "Salt and freshly ground black pepper"
                ],
                "cookingMethod": [
                    "Bring a large pot of salted water to a boil. Add the spaghetti and cook until al dente, about 8 minutes.",
                    "Meanwhile, in a large skillet, cook the pancetta or bacon over medium heat until crispy, about 8 minutes.",
                    "Add the garlic to the skillet and cook for an additional minute.",
                    "In a medium bowl, whisk together the eggs and Parmesan cheese. Season with salt and pepper.",
                    "When the spaghetti is cooked, drain it and add it to the skillet with the pancetta or bacon. Toss to combine.",
                    "Remove the skillet from the heat and let it cool for a minute or two. Then, pour the egg mixture over the spaghetti and toss until the pasta is coated and the eggs are cooked.",
                    "Serve the spaghetti carbonara immediately, garnished with additional Parmesan cheese and black pepper, if desired."
                ]
            }
        ],
        "bio": "Giuseppe is a third-generation Italian chef who learned to cook from his Nonna in Rome. He has over 20 years of experience working in some of the best Italian restaurants in New York City. Giuseppe is passionate about bringing authentic Italian flavors to every dish he creates.",
        "likes": 450,
        "rating": 4.8
    },
    {
        "id": 4,
        "chefName": "Maria",
        "chefPicture": "https://media.lacucinaitaliana.com/photos/604f424f79e98a7b0656e3fa/1:1/h_450,c_limit/Jessica%20Rosval%20credits%20Paolo%20Terzi.jpg",
        "experience": "15 years",
        "recipes": [
            {
                "name": "Pesto Pasta",
                "ingredients": [
                    "1 pound pasta",
                    "2 cups fresh basil leaves",
                    "1/2 cup grated Parmesan cheese",
                    "1/2 cup olive oil",
                    "1/3 cup pine nuts",
                    "2 cloves garlic, minced"
                ],
                "cookingMethod": [
                    "Cook the pasta according to package directions until al dente. Drain and set aside.",
                    "In a food processor, combine the basil, Parmesan cheese, olive oil, pine nuts, and garlic. Process until smooth.",
                    "Toss the pesto with the cooked pasta until well coated. Serve immediately, garnished with additional Parmesan cheese and chopped basil, if desired."
                ]
            },
            {
                "name": "Caprese Salad",
                "ingredients": [
                    "2 large tomatoes, sliced",
                    "1/2 pound fresh mozzarella cheese, sliced",
                    "1/4 cup fresh basil leaves",
                    "2 tablespoons balsamic vinegar",
                    "2 tablespoons olive oil",
                    "Salt and freshly ground black pepper"
                ],
                "cookingMethod": [
                    "Arrange the tomato and mozzarella slices on a large platter, alternating them.",
                    "Scatter the basil leaves over the top of the tomatoes and mozzarella.",
                    "In a small bowl, whisk together the balsamic vinegar and olive oil. Season with salt and pepper.",
                    "Drizzle the dressing over the top of the salad. Serve immediately."
                ]
            },
            {
                "name": "Tiramisu",
                "ingredients": [
                    "6 egg yolks",
                    "3/4 cup granulated sugar",
                    "2/3 cup whole milk",
                    "1/4 cup Marsala or brandy",
                    "1 1/2 cups heavy cream",
                    "1 cup mascarpone cheese",
                    "2 cups brewed espresso or strong coffee, cooled",
                    "1/2 cup Kahlua or other coffee liqueur",
                    "1 package ladyfingers",
                    "Cocoa powder"
                ],
                "cookingMethod": [
                    "Whisk together the egg yolks and sugar in a medium saucepan. Add the milk and Marsala or brandy, and whisk to combine.",
                    "Cook the mixture over low heat, stirring constantly, until it thickens and coats the back of a spoon, about 10 minutes.",
                    "Remove the saucepan from the heat and let the mixture cool completely.",
                    "Beat the heavy cream until stiff peaks form in a large bowl.",
                    "In another large bowl, beat the mascarpone cheese until smooth. Fold in the cooled egg yolk mixture.",
                    "Fold the whipped cream into the mascarpone mixture until well combined.",
                    "Whisk together the brewed espresso and coffee liqueur in a shallow dish.",
                    "Dip the ladyfingers into the espresso mixture, one at a time, and arrange them in a single layer in the bottom of a 9x13-inch baking dish.",
                    "Spread half of the mascarpone mixture over the ladyfingers. Repeat with another layer of soaked ladyfingers and the remaining mascarpone mixture.",
                    "Cover the baking dish with plastic wrap and refrigerate the tiramisu for at least 2 hours, or overnight.",
                    "Dust the top of the tiramisu with cocoa powder before serving  "
                ]
            }
        ],
        "bio": "Maria is a passionate Italian chef who has been cooking for over 15 years. She specializes in traditional Italian cuisine and loves to experiment with new flavors and ingredients.",
        "likes": 500,
        "rating": 4.6
    },
    {
        "id": 5,
        "chefName": "Giuseppe",
        "chefPicture": "https://images.getbento.com/accounts/d8359f61b43ef4d152cf9e1edc857efe/media/images/10244IMG_5014.jpg?w=1200&fit=max&auto=compress,format",
        "experience": 20,
        "recipes": [
            {
                "name": "Spaghetti Aglio e Olio",
                "description": "A simple and classic Italian pasta dish.",
                "ingredients": [
                    "1 pound spaghetti",
                    "1/3 cup olive oil",
                    "8 cloves garlic, minced",
                    "1/2 teaspoon red pepper flakes",
                    "1/2 cup fresh parsley leaves, chopped",
                    "1/2 cup Parmesan cheese, grated"
                ],
                "cookingMethod": [
                    "Bring a large pot of salted water to a boil. Add the spaghetti and cook until al dente, about 8-10 minutes.",
                    "Meanwhile, heat the olive oil in a large skillet over medium heat. Add the garlic and red pepper flakes and cook until fragrant, about 1-2 minutes.",
                    "Drain the spaghetti and reserve 1 cup of the pasta water. Add the spaghetti and reserved pasta water to the skillet and toss to coat with the garlic and oil mixture.",
                    "Add the parsley and Parmesan cheese and toss to combine. Season with salt and black pepper to taste.",
                    "Serve hot."
                ]
            },
            {
                "name": "Pesto Chicken",
                "description": "A delicious and easy-to-make chicken dish with pesto sauce.",
                "ingredients": [
                    "4 boneless, skinless chicken breasts",
                    "1/2 cup pesto sauce",
                    "1/2 cup cherry tomatoes, halved",
                    "1/2 cup mozzarella cheese, shredded",
                    "Salt and pepper to taste"
                ],
                "cookingMethod": [
                    "Preheat the oven to 375°F.",
                    "Season the chicken breasts with salt and pepper to taste and place them in a baking dish.",
                    "Spread the pesto sauce evenly over each chicken breast.",
                    "Top each chicken breast with cherry tomatoes and mozzarella cheese.",
                    "Bake in the preheated oven for 25-30 minutes, or until the chicken is cooked through and the cheese is melted and bubbly.",
                    "Serve hot."
                ]
            },
            {
                "name": "Tiramisu",
                "description": "A classic Italian dessert with layers of ladyfingers, espresso, and mascarpone cream.",
                "ingredients": [
                    "6 egg yolks",
                    "3/4 cup sugar",
                    "2/3 cup milk",
                    "1 1/4 cups heavy cream",
                    "1/2 teaspoon vanilla extract",
                    "1 pound mascarpone cheese, room temperature",
                    "1/2 cup brewed espresso or strong coffee, cooled",
                    "24 ladyfingers",
                    "Cocoa powder, for dusting"
                ],
                "cookingMethod": [
                    "In a medium saucepan, whisk together the egg yolks and sugar until well combined. Whisk in the milk and place the saucepan over medium heat.",
                    "Cook the mixture, whisking constantly, until it thickens and coats the back of a spoon, about 10 minutes. Remove from the heat and let cool completely.",
                    "In a large bowl, beat the heavy cream and vanilla extract until stiff peaks form.",
                    "Add the mascarpone cheese to the cooled egg yolk mixture and beat until smooth.",
                    "Gently fold the whipped cream into the mascarpone mixture until fully combined.",
                    "To assemble the tiramisu, dip each ladyfinger into"
                ]
            }
        ],
        "bio": "Maria is a passionate Italian chef who has been cooking for over 15 years. She specializes in traditional Italian cuisine and loves to experiment with new flavors and ingredients.",
        "likes": 500,
        "rating": 4.3
    },
    {
        "id": 9,
        "chefName": "Maria Bianchi",
        "chefPicture": "https://example.com/chef9.jpg",
        "experience": "15 years",
        "recipes": [
            {
                "name": "Caprese Salad",
                "ingredients": [
                    "Tomatoes",
                    "Fresh Mozzarella",
                    "Basil Leaves",
                    "Balsamic Vinegar",
                    "Extra Virgin Olive Oil"
                ],
                "cookingMethod": [
                    "Slice the tomatoes and mozzarella into thin rounds",
                    "Arrange them alternately on a plate",
                    "Drizzle with balsamic vinegar and olive oil",
                    "Garnish with basil leaves"
                ]
            },
            {
                "name": "Bruschetta",
                "ingredients": [
                    "Bread",
                    "Tomatoes",
                    "Garlic",
                    "Basil Leaves",
                    "Extra Virgin Olive Oil"
                ],
                "cookingMethod": [
                    "Slice the bread into thin pieces and toast them",
                    "Chop the tomatoes and mix with minced garlic and chopped basil leaves",
                    "Top the bread slices with the tomato mixture",
                    "Drizzle with olive oil"
                ]
            },
            {
                "name": "Tiramisu",
                "ingredients": [
                    "Ladyfingers",
                    "Mascarpone Cheese",
                    "Eggs",
                    "Sugar",
                    "Coffee",
                    "Cocoa Powder"
                ],
                "cookingMethod": [
                    "Separate egg yolks and whites",
                    "Whisk egg yolks with sugar and mascarpone cheese",
                    "Whisk egg whites until stiff peaks form and fold into the mascarpone mixture",
                    "Dip ladyfingers in coffee and arrange in a dish",
                    "Spread the mascarpone mixture over the ladyfingers",
                    "Dust with cocoa powder",
                    "Chill in the fridge for at least 2 hours"
                ]
            }
        ],
        "bio": "Maria Bianchi is a passionate Italian chef who grew up in a family of foodies. She learned the art of cooking from her mother and grandmother, and has been honing her skills ever since. She believes in using fresh, locally sourced ingredients and traditional cooking techniques to create authentic Italian dishes.",
        "likes": 350,
        "rating": 4.1
    }
]